library/library/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE '%千と千尋の神隠し%' OR author LIKE '%千と千尋の神隠し%')
SELECT "books".* FROM "books" LEFT OUTER JOIN "reviews" ON "reviews"."book_id" = "books"."id" GROUP BY "books"."id" ORDER BY AVG(reviews.rating) DESC NULLS LAST
---
  def index
    @books = Book.all

   if params[:search].present?
    @books = Book.where("title LIKE ? OR author LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%")
  else
    @books = Book.left_joins( :reviews)
                 .group( :id)
                 .order(Arel.sql('AVG(reviews.rating) DESC NULLS LAST'))

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = 1
---
  def show
  @book = Book.find(params[:id])
  @reviews = @book.reviews.includes(:user)

INSERT INTO "books" ("title", "author", "status", "category", "memo", "user_id", "created_at", "updated_at") VALUES ('吾輩は猫である', '夏目漱石', 1, '文学', '日本で最も有名な本の一つ', 2, '2025-07-01 05:51:45.761917', '2025-07-01 05:51:45.761917') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
    def set_book
      @book = Book.find(params.expect(:id))